# Pandas

![Image Name](https://cdn.kesci.com/upload/image/pjyppc3z71.png?imageView2/0/w/320/h/320)


在这个项目中，我们将学习使用Python Pandas库进行基础的数据分析。


![Image Name](https://cdn.kesci.com/upload/image/pjypprtum1.png?imageView2/0/w/320/h/320)

## 上传数据集
我们首先需要获得可以分析探索的数据。这里选择直接下载，如果你在使用 K-Lab，你也可以直接挂载[泰坦尼克号数据集](https://www.kesci.com/home/dataset/58a940107159a710d916aefb)

In [1]:
import urllib

In [2]:
# Upload data from GitHub to notebook's local drive
url = "https://raw.githubusercontent.com/GokuMohandas/practicalAI/master/data/titanic.csv"
response = urllib.request.urlopen(url)
html = response.read()
with open('titanic.csv', 'wb') as f:
    f.write(html)

In [3]:
# Checking if the data was uploaded
!ls -l

total 21644
drwxr-xr-x 2 kesci root     4096 Dec 18 06:33 adRnn
drwxr-xr-x 3 kesci root     4096 Dec 18 03:11 cnn
drwxr-xr-x 4 kesci root     4096 Dec 18 08:56 computervision
drwxr-xr-x 3 kesci root     4096 Dec 18 03:41 embedding
-rw-r--r-- 1 kesci users  536521 Dec 10 07:55 init_net.pb
-rw-r--r-- 1 kesci users 1735718 Dec 13 14:41 lenet
-rw-r--r-- 1 kesci users 1734178 Dec 13 06:53 LeNet
-rw-r--r-- 1 kesci users 1747834 Dec 14 06:53 LeNet_2.onnx
-rw-r--r-- 1 kesci users 1746002 Dec 14 07:59 LeNet.onnx
-rw-r--r-- 1 kesci users 1735718 Dec 13 14:41 lenet.pth
drwxr-xr-x 2 kesci root     4096 Dec 17 13:07 linear_regression
drwxr-xr-x 2 kesci root     4096 Dec 14 06:11 mnistKeras
drwxr-xr-x 4 kesci root     4096 Dec 13 08:32 mnistTF
drwxr-xr-x 5 kesci root     4096 Dec 14 07:50 mnistTorch
drwxr-xr-x 2 kesci users    4096 Dec 18 03:07 names
-rw-r--r-- 1 kesci users 6131239 Dec 18 06:39 news.csv
-rw-r--r-- 1 kesci users     402 Dec 10 07:55 predict_net.pb
drwxr-xr-x 3 kesci root     4096 Dec 18 06:26 rnn
-rw-r--r-- 1 kesci users 6646581 Dec 18 06:39 split_news.csv
-rw-r--r-- 1 kesci users   85153 Dec 19 02:37 titanic.csv
-rw-r--r-- 1 kesci users    4862 Dec 14 07:29 t.py

## 加载数据
OK数据下载完了，现在将它加载到 Pandas 数据帧(dataframe)中。

In [4]:
import pandas as pd

In [5]:
# 从CSV文件读取到DataFrame
df = pd.read_csv("titanic.csv", header=0)

In [6]:
# 前五行数据
df.head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0

这个数据集有以下这些列名:

* pclass: 船舱等级 class of travel
* name: 全名 full name of the passenger
* sex: 性别 gender
* age: 年龄 numerical age
* sibsp: 船上旁系亲属，配偶数 # of siblings/spouse aboard
* parch: 船上直系亲属(父母，子女)数 number of parents/child aboard
* ticket: 船票号 ticket number
* fare: 船票费用 cost of the ticket
* cabin: 房间位置 location of room
* emarked: 上船的港口 (C - 瑟堡Cherbourg, S - 南安普顿Southampton, Q = 皇后镇Queenstown)
* survived: 是否存活 (0 - 死亡, 1 - 存活)

## 探索性分析
我们将一边探索使用 Pandas 库，一边看看如何探索处理数据。

In [7]:
# 叙述性统计
df.describe()

,pclass,age,sibsp,parch,fare,survived
count,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,1309.000000
mean,2.294882,29.881135,0.498854,0.385027,33.295479,0.381971
std,0.837836,14.413500,1.041658,0.865560,51.758668,0.486055
min,1.000000,0.166700,0.000000,0.000000,0.000000,0.000000
25%,2.000000,21.000000,0.000000,0.000000,7.895800,0.000000
50%,3.000000,28.000000,0.000000,0.000000,14.454200,0.000000
75%,3.000000,39.000000,1.000000,0.000000,31.275000,1.000000
max,3.000000,80.000000,8.000000,9.000000,512.329200,1.000000

In [9]:
# 直方图
df["age"].hist()

In [10]:
# 唯一值
df["embarked"].unique()

array(['S', 'C', nan, 'Q'], dtype=object)

In [11]:
# 按列名查看
df["name"].head()

0                      Allen, Miss. Elisabeth Walton
1                     Allison, Master. Hudson Trevor
2                       Allison, Miss. Helen Loraine
3               Allison, Mr. Hudson Joshua Creighton
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
Name: name, dtype: object

In [12]:
# 筛选数据
df[df["sex"]=="female"].head() # only the female data appear

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,B5,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S,0
6,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,1
8,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,1

In [13]:
# 排序
df.sort_values("age", ascending=False).head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
14,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S,1
61,1,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1,0,19877,78.8500,C46,S,1
1235,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S,0
135,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C,0
9,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,0

In [14]:
# 数据聚合
survived_group = df.groupby("survived")
survived_group.mean()

            pclass        age     sibsp     parch       fare
survived
0         2.500618  30.545369  0.521632  0.328801  23.353831
1         1.962000  28.918228  0.462000  0.476000  49.361184

In [15]:
# 使用索引用 iloc 查看数据
df.iloc[0, :] # iloc 函数通过索引中的特定位置查看某行或列的数据，所以这里的索引值应该只接受整数

pclass                                  1
name        Allen, Miss. Elisabeth Walton
sex                                female
age                                    29
sibsp                                   0
parch                                   0
ticket                              24160
fare                              211.338
cabin                                  B5
embarked                                S
survived                                1
Name: 0, dtype: object

In [16]:
# 获取指定位置的数据
df.iloc[0, 1]

'Allen, Miss. Elisabeth Walton'

In [17]:
# 根据索引值用 loc 查看
df.loc[0] # 用loc从索引中插卡具有特定标签的行或列

pclass                                  1
name        Allen, Miss. Elisabeth Walton
sex                                female
age                                    29
sibsp                                   0
parch                                   0
ticket                              24160
fare                              211.338
cabin                                  B5
embarked                                S
survived                                1
Name: 0, dtype: object

## 预处理

In [18]:
# 查看含有至少一个NaN值的数据
df[pd.isnull(df).any(axis=1)].head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
9,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,0
13,1,"Barber, Miss. Ellen ""Nellie""",female,26.0,0,0,19877,78.8500,NaN,S,1
15,1,"Baumann, Mr. John D",male,NaN,0,0,PC 17318,25.9250,NaN,S,0
23,1,"Bidois, Miss. Rosalie",female,42.0,0,0,PC 17757,227.5250,NaN,C,1
25,1,"Birnbaum, Mr. Jakob",male,25.0,0,0,13905,26.0000,NaN,C,0

In [19]:
# 删除含有NaN值的数据行
df = df.dropna() # 删除含有NaN值的行
df = df.reset_index() # 重置行的索引
df.head()

,index,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
3,3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0
4,4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0

In [20]:
# 删除多列
df = df.drop(["name", "cabin", "ticket"], axis=1) # 暂时不需要类型为文本的数据条目
df.head()

   index  pclass     sex      age  sibsp  parch      fare embarked  survived
0      0       1  female  29.0000      0      0  211.3375        S         1
1      1       1    male   0.9167      1      2  151.5500        S         1
2      2       1  female   2.0000      1      2  151.5500        S         0
3      3       1    male  30.0000      1      2  151.5500        S         0
4      4       1  female  25.0000      1      2  151.5500        S         0

In [21]:
# 特征值映射
df['sex'] = df['sex'].map( {'female': 0, 'male': 1} ).astype(int)
df["embarked"] = df['embarked'].dropna().map( {'S':0, 'C':1, 'Q':2} ).astype(int)
df.head()

   index  pclass  sex      age  sibsp  parch      fare  embarked  survived
0      0       1    0  29.0000      0      0  211.3375         0         1
1      1       1    1   0.9167      1      2  151.5500         0         1
2      2       1    0   2.0000      1      2  151.5500         0         0
3      3       1    1  30.0000      1      2  151.5500         0         0
4      4       1    0  25.0000      1      2  151.5500         0         0

## 特征工程

In [22]:
# 用lambda表达式创建新特征
def get_family_size(sibsp, parch):
    family_size = sibsp + parch
    return family_size

df["family_size"] = df[["sibsp", "parch"]].apply(lambda x: get_family_size(x["sibsp"], x["parch"]), axis=1)
df.head()

,index,pclass,sex,age,sibsp,parch,fare,embarked,survived,family_size
0,0,1,0,29.0000,0,0,211.3375,0,1,0
1,1,1,1,0.9167,1,2,151.5500,0,1,3
2,2,1,0,2.0000,1,2,151.5500,0,0,3
3,3,1,1,30.0000,1,2,151.5500,0,0,3
4,4,1,0,25.0000,1,2,151.5500,0,0,3

In [24]:
# 重新组织表头
df = df[['pclass', 'sex', 'age', 'sibsp', 'parch', 'family_size', 'fare', 'embarked', 'survived']]
df.head()

,pclass,sex,age,sibsp,parch,family_size,fare,embarked,survived
0,1,0,29.0000,0,0,0,211.3375,0,1
1,1,1,0.9167,1,2,3,151.5500,0,1
2,1,0,2.0000,1,2,3,151.5500,0,0
3,1,1,30.0000,1,2,3,151.5500,0,0
4,1,0,25.0000,1,2,3,151.5500,0,0

## 存储数据

In [25]:
# 把Dataframe存进CSV文件
df.to_csv("processed_titanic.csv", index=False)

In [27]:
# 查看存好的数据
!ls -l

total 21652
drwxr-xr-x 2 kesci root     4096 Dec 18 06:33 adRnn
drwxr-xr-x 3 kesci root     4096 Dec 18 03:11 cnn
drwxr-xr-x 4 kesci root     4096 Dec 18 08:56 computervision
drwxr-xr-x 3 kesci root     4096 Dec 18 03:41 embedding
-rw-r--r-- 1 kesci users  536521 Dec 10 07:55 init_net.pb
-rw-r--r-- 1 kesci users 1735718 Dec 13 14:41 lenet
-rw-r--r-- 1 kesci users 1734178 Dec 13 06:53 LeNet
-rw-r--r-- 1 kesci users 1747834 Dec 14 06:53 LeNet_2.onnx
-rw-r--r-- 1 kesci users 1746002 Dec 14 07:59 LeNet.onnx
-rw-r--r-- 1 kesci users 1735718 Dec 13 14:41 lenet.pth
drwxr-xr-x 2 kesci root     4096 Dec 17 13:07 linear_regression
drwxr-xr-x 2 kesci root     4096 Dec 14 06:11 mnistKeras
drwxr-xr-x 4 kesci root     4096 Dec 13 08:32 mnistTF
drwxr-xr-x 5 kesci root     4096 Dec 14 07:50 mnistTorch
drwxr-xr-x 2 kesci users    4096 Dec 18 03:07 names
-rw-r--r-- 1 kesci users 6131239 Dec 18 06:39 news.csv
-rw-r--r-- 1 kesci users     402 Dec 10 07:55 predict_net.pb
-rw-r--r-- 1 kesci users    6975 Dec 19 03:23 processed_titanic.csv
drwxr-xr-x 3 kesci root     4096 Dec 18 06:26 rnn
-rw-r--r-- 1 kesci users 6646581 Dec 18 06:39 split_news.csv
-rw-r--r-- 1 kesci users   85153 Dec 19 02:37 titanic.csv
-rw-r--r-- 1 kesci users    4862 Dec 14 07:29 t.py